GetTemporaryViewPropertiesId Method
 When Temporary View Properties mode is in progress it provides view id that overrode settings for current view. Outside Temporary View Properties mode InvalidElementId will be returned.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  Since:  2014
 Syntax
  C#
public ElementId GetTemporaryViewPropertiesId()
  Visual Basic
Public Function GetTemporaryViewPropertiesId As ElementId
  Visual C++
public:
ElementId^ GetTemporaryViewPropertiesId()
 Remarks
 Returned ElementId might refer to element that was deleted. It will happen when Temporary View Properties mode was applied basing on template that next was deleted.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →